; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v12)
             (pred_4 ?v4 ?v11)
             (pred_8 ?v5 ?v11)
             (pred_11 ?v9 ?v5 )
	     (pred_10 ?v5)
             (pred_6 ?v1)
             (pred_12 ?v4)
             (pred_2 ?v11)
             (pred_5 ?v5)
             (pred_7 ?v4)
             (pred_3 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v13 ?v2 ?v6 ?v7)
:precondition (and (pred_6 ?v13) (pred_6 ?v2) (pred_12 ?v6) (pred_2 ?v7)
          (pred_9 ?v13 ?v2) (pred_4 ?v6 ?v7)
                   (pred_8 ?v2 ?v7) (pred_10 ?v13) 
                   (pred_5 ?v2) (pred_7 ?v6))
:effect (and  (pred_3 ?v2) (not (pred_5 ?v2))))


(:action op_5
:parameters (?v13 ?v3)
:precondition (and (pred_6 ?v13) (pred_6 ?v3)
               (pred_10 ?v13) (pred_9 ?v13 ?v3) (pred_3 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v13))))

(:action op_2
:parameters (?v13 ?v6)
:precondition (and (pred_6 ?v13) (pred_12 ?v6) 
                  (pred_10 ?v13) (pred_11 ?v6 ?v13) (pred_1 ))
:effect (and (pred_7 ?v6)
   (not (pred_11 ?v6 ?v13)) (not (pred_1 ))))


(:action op_3
:parameters (?v13 ?v8 ?v10)
:precondition (and (pred_6 ?v13) (pred_12 ?v8) (pred_12 ?v10)
                  (pred_10 ?v13) (pred_7 ?v10) (pred_11 ?v8 ?v13))
:effect (and (pred_7 ?v8) (pred_11 ?v10 ?v13)
        (not (pred_7 ?v10)) (not (pred_11 ?v8 ?v13))))

(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_6 ?v13) (pred_12 ?v6) 
                  (pred_10 ?v13) (pred_7 ?v6))
:effect (and (pred_1 ) (pred_11 ?v6 ?v13) (not (pred_7 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_09 obj_08 obj_17 obj_11 obj_03 obj_01 obj_07 obj_12 obj_05 obj_21 obj_15 obj_13 obj_14 obj_04 obj_02
    obj_10 obj_20
    obj_18 obj_19 obj_06
    )

    (:init
       (pred_1)

       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_01)
       (pred_6 obj_07)
       (pred_6 obj_12)
       (pred_6 obj_05)
       (pred_6 obj_21)
       (pred_6 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_06)

       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_03)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_01 obj_21)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_05 obj_21)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_21 obj_04)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_21 obj_01)
       (pred_9 obj_21 obj_05)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_13 obj_14)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_14 obj_13)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_21)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_04)
       (pred_5 obj_02)
       (pred_5 obj_01)
       (pred_5 obj_04)
       (pred_8  obj_02 obj_10)
       (pred_8  obj_01 obj_20)
       (pred_8  obj_04 obj_10)
       (pred_3 obj_16)
       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_21)
       (pred_3 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_14)

       (pred_4  obj_18 obj_10)
       (pred_4  obj_19 obj_20)
       (pred_4  obj_06 obj_10)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_06 obj_16)
       (pred_10 obj_14)
    )

    (:goal (and
       (pred_11 obj_18 obj_13)
       (pred_11 obj_06 obj_17)
    ))
(:constraints
  (always (not (pred_10 obj_12)))
)
)

; plan
1. (op_5 obj_14 obj_05)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_05)
   goals met: 0 of 2
2. (op_5 obj_05 obj_03)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_03)
   goals met: 0 of 2
3. (op_5 obj_03 obj_11)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_11)
   goals met: 0 of 2
4. (op_5 obj_11 obj_16)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_16)
   goals met: 0 of 2
5. (op_2 obj_16 obj_06)
   deleted: (pred_11 obj_06 obj_16) (pred_1)
   added: (pred_7 obj_06)
   goals met: 0 of 2
6. (op_5 obj_16 obj_09)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_09)
   goals met: 0 of 2
7. (op_5 obj_09 obj_08)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_08)
   goals met: 0 of 2
8. (op_5 obj_08 obj_17)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_17)
   goals met: 0 of 2
9. (op_1 obj_17 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_1) (pred_11 obj_06 obj_17)
   goals met: 1 of 2
10. (op_5 obj_17 obj_08)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_08)
   goals met: 1 of 2
11. (op_5 obj_08 obj_09)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_09)
   goals met: 1 of 2
12. (op_5 obj_09 obj_16)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_16)
   goals met: 1 of 2
13. (op_5 obj_16 obj_11)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_11)
   goals met: 1 of 2
14. (op_2 obj_11 obj_18)
   deleted: (pred_11 obj_18 obj_11) (pred_1)
   added: (pred_7 obj_18)
   goals met: 1 of 2
15. (op_5 obj_11 obj_03)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_03)
   goals met: 1 of 2
16. (op_5 obj_03 obj_05)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_05)
   goals met: 1 of 2
17. (op_5 obj_05 obj_14)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_14)
   goals met: 1 of 2
18. (op_5 obj_14 obj_13)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_13)
   goals met: 1 of 2
19. (op_1 obj_13 obj_18)
   deleted: (pred_7 obj_18)
   added: (pred_1) (pred_11 obj_18 obj_13)
   goals met: 2 of 2
